# Создание и управление таблицами

In [ ]:
# connection.comit() ===> нужно писать после любого изменения в базе данных, после select не надо

# В первую очередь импортируем sqlite3
import sqlite3

In [ ]:
# Создаем подключение к базе данных (файл my_database.db будет создан)
connection = sqlite3.connect('my_database.db')
# Устанавливаем соединение с базой данных, и называем файл sqlite как my_database.db(если его нет конечно, то создается и назовется my_database.db)
# то есть файл sqlite будет называться my_database.db

# connection.close()

In [ ]:
type(connection)

sqlite3.Connection

In [ ]:
cursor = connection.cursor()

# Создаем таблицу и назовём его Users
cursor.execute('''
CREATE TABLE IF NOT EXISTS Users (
    id INTEGER PRIMARY KEY,
    username TEXT NOT NULL,
    email TEXT NOT NULL,
    age INTEGER
)
''')

# Сохраняем изменения и закрываем соединение
connection.commit() # connection.comit() нужно писать после любого изменения в базе данных

In [ ]:
# Выбираем всех пользователей
cursor.execute('SELECT * FROM Users')
users = cursor.fetchall()

# Выводим результаты
for user in users:
  print(user)

# Системная таблица sqlite_master

In [ ]:
# Выполняем запрос к системной таблице sqlite_master
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
tables = cursor.fetchall()
# Этот запрос извлекает имена всех таблиц, так как:
# type='table' фильтрует только таблицы.
# name содержит их имена.

# Выводим названия всех таблиц
for table in tables:
    print(table[0]) #only the first value from every set, now we don't have any values


# sqlite_master — это специальная системная таблица в SQLite, которая содержит информацию о всех других таблицах, индексах, триггерах и вьюхах в базе данных.
# Она создается автоматически и является стандартной частью всех SQLite баз данных.
# Таблица sqlite_master имеет следующие стандартные столбцы:
# 1. type: Тип объекта (может быть "table", "index", "view" или "trigger").
# 2. name: Имя объекта.
# 3. tbl_name: Имя таблицы, к которой относится объект (имеет значение только для индексов, триггеров и вьюх).
# 4. rootpage: Номер первой страницы, используемой для хранения данных объекта в файле базы данных (имеет значение только для таблиц и индексов).
# 5. sql: SQL-запрос, использованный для создания объекта (может быть NULL для некоторых объектов, например, для индексов, созданных автоматически).
# Эти столбцы и их названия являются стандартными и определены спецификацией SQLite, поэтому они всегда будут одинаковыми во всех базах данных SQLite, и именно в этих названях.


# table[0] используется для получения первого элемента каждой записи в результатах запроса.
# Когда выполняем запрос SELECT name FROM sqlite_master WHERE type='table';,
# результатом будет список кортежей, где каждый кортеж содержит одно значение — имя таблицы.

# Пример:
# tables = cursor.fetchall()  # [('table1',), ('table2',), ...]
# for table in tables:
#     print(table[0])  # Выводит 'table1', 'table2', ...

# `table[0]` извлекает первое (и единственное) значение из каждого кортежа, то есть имя таблицы.

Users

In [ ]:
# Выполняем запрос к системной таблице sqlite_master
cursor.execute("SELECT name FROM sqlite_master")
tables = cursor.fetchall()

# Выводим названия всех таблиц
for table in tables:
    print(table) # the whole set. now we have only an empty set ('Users',)

('Users',)

# Получить список столбцов таблицы с именем Users,
# Извлечь и вывести названия столбцов данной таблицы.

In [ ]:
# Получаем информацию о столбцах для указанной таблицы
cursor.execute("PRAGMA table_info('Users')") # Users is the table_name
# cursor.execute("PRAGMA table_info(Users)") #можно без ковычек тоже
columns_info = cursor.fetchall()

# Выводим названия столбцов
columns = []
for column_info in columns_info:
    columns.append(column_info[1]) # [1] to display only names of columns(столбцы)

print(columns)


# PRAGMA table_info — это специальная команда SQLite, которая используется для получения информации о структуре таблицы.
# Она возвращает метаданные о таблице, включая имена столбцов, их типы данных, ограничения и другие характеристики.

# В прошлом примере PRAGMA table_info('Users') использовалась для того, чтобы получить список столбцов таблицы с именем Users.
# Эта информация была необходима, чтобы извлечь и вывести названия столбцов данной таблицы.

['id', 'username', 'email', 'age']

In [ ]:
columns_info

[(0, 'id', 'INTEGER', 0, None, 1),
 (1, 'username', 'TEXT', 1, None, 0),
 (2, 'email', 'TEXT', 1, None, 0),
 (3, 'age', 'INTEGER', 0, None, 0)]

# Удаление таблицы

In [ ]:
# Удаление таблицы
# Удаление таблицы выполняется с помощью оператора DROP. Синтаксис оператора DROP выглядит следующим образом:

# drop table table_name;

# Чтобы удалить таблицу, таблица должна существовать в БД. Поэтому рекомендуется использовать «if exists» с оператором DROP. Например, удалим таблицу employees:



# Если УДАЛИТЬ таблицу ,нужно будет создавать ее ЗАНОВО ===>

# # import sqlite3
# # connection = sqlite3.connect('my_database.db')
# # cursor = connection.cursor()
# # cursor.execute('DROP table if exists Users')
# # connection.commit()

In [ ]:
# Выбираем всех пользователей
cursor.execute('SELECT * FROM Users')
users = cursor.fetchall()

# Выводим результаты
for user in users:
  print(user)

# Вставка, обновление и удаление данных

In [ ]:
# Добавляем нового пользователя в sqlite
cursor.execute('INSERT INTO Users (username, email, age) VALUES (?, ?, ?)', ('newuser', 'newuser@example.com', 28));

In [ ]:
# Выбираем всех пользователей
cursor.execute('SELECT * FROM Users')
users = cursor.fetchall()

# Выводим результаты
for user in users:
  print(user)

(1, 'newuser', 'newuser@example.com', 28)

In [ ]:
connection.close()

In [ ]:
connection = sqlite3.connect('my_database.db')
cursor = connection.cursor()

In [ ]:
# Выбираем всех пользователей
cursor.execute('SELECT * FROM Users')
users = cursor.fetchall()

# Выводим результаты
for user in users:
  print(user)

In [ ]:
# DROP
# cursor.execute('DROP table if exists Users ')

In [ ]:
# Добавляем нового пользователя
cursor.execute('INSERT INTO Users (username, email, age) VALUES (?, ?, ?)', ('newuser', 'newuser@example.com', 28));
connection.commit()

In [ ]:
# Выбираем всех пользователей
cursor.execute('SELECT * FROM Users')
users = cursor.fetchall()

# Выводим результаты
for user in users:
  print(user)

(1, 'newuser', 'newuser@example.com', 28)

# Вставить сразу несколько строк в таблицу SQLite с использованием Python

In [ ]:
# SQL-запрос для вставки строки в таблицу Users
sql_query = 'INSERT INTO Users (username, email, age) VALUES (?, ?, ?)'

# Список кортежей с данными для вставки
data_to_insert = [
    ('user1', 'user1@example.com', 25),
    ('user2', 'user2@example.com', 30),
    ('user3', 'user3@example.com', 22)
]

# Вставляем несколько строк сразу
cursor.executemany(sql_query, data_to_insert)

# Сохраняем изменения
connection.commit()

In [ ]:
# Выбираем всех пользователей
cursor.execute('SELECT * FROM Users')
users = cursor.fetchall()

# Выводим результаты
for user in users:
  print(user)

(1, 'newuser', 'newuser@example.com', 28)
(2, 'user1', 'user1@example.com', 25)
(3, 'user2', 'user2@example.com', 30)
(4, 'user3', 'user3@example.com', 22)

# Обновление столбцов в таблице

In [ ]:
# Обновляем возраст пользователя "newuser"
cursor.execute('UPDATE Users SET age = ? WHERE username = ?', (29, 'newuser'))

# Сохраняем изменения
connection.commit()

In [ ]:
# Выбираем всех пользователей
cursor.execute('SELECT * FROM Users')
users = cursor.fetchall()

# Выводим результаты
for user in users:
  print(user)

(1, 'newuser', 'newuser@example.com', 29)
(2, 'user1', 'user1@example.com', 25)
(3, 'user2', 'user2@example.com', 30)
(4, 'user3', 'user3@example.com', 22)

In [ ]:
# Обновляем возраст пользователя "newuser" и его почта
cursor.execute('UPDATE Users SET age = ?, email = ? WHERE username = ?', (59, 'newuser@inn.ru', 'newuser'))

# Сохраняем изменения
connection.commit()

In [ ]:
# Выбираем всех пользователей
cursor.execute('SELECT * FROM Users')
users = cursor.fetchall()

# Выводим результаты
for user in users:
  print(user)

(1, 'newuser', 'newuser@inn.ru', 59)
(2, 'user1', 'user1@example.com', 25)
(3, 'user2', 'user2@example.com', 30)
(4, 'user3', 'user3@example.com', 22)

In [ ]:

cursor.execute('DELETE FROM Users WHERE username = ?', ('newuser',))
#### cursor.execute('DELETE FROM Usersэ') # А так удаляем всеее, поэтому внимательно с функцию DELETE

# Сохраняем изменения и закрываем соединение
connection.commit()

In [ ]:
# Выбираем всех пользователей
cursor.execute('SELECT * FROM Users')
users = cursor.fetchall()

# Выводим результаты
for user in users:
  print(user)

(2, 'user1', 'user1@example.com', 25)
(3, 'user2', 'user2@example.com', 30)
(4, 'user3', 'user3@example.com', 22)

In [ ]:
# Выбираем имена и возраст пользователей старше 25 лет
cursor.execute('SELECT username, age FROM Users WHERE age >= ?', (25,))
results = cursor.fetchall()

for row in results:
  print(row)

('user1', 25)
('user2', 30)

In [ ]:
c = (25 - 5,)

In [ ]:
type(c)

tuple

In [ ]:
c

(20,)

In [ ]:
# Выбираем и сортируем пользователей по возрасту по убыванию
cursor.execute('SELECT username, age FROM Users ORDER BY age DESC')
results = cursor.fetchall()

for row in results:
  print(row)

('user2', 30)
('user1', 25)
('user3', 22)

In [ ]:
# Выбираем и сортируем пользователей по возрасту по убыванию
cursor.execute('SELECT username, age FROM Users ORDER BY age ASC')
results = cursor.fetchall()

for row in results:
  print(row)

('user3', 22)
('user1', 25)
('user2', 30)

In [ ]:
# Выбираем и сортируем пользователей по возрасту по убыванию
cursor.execute('SELECT username, age FROM Users ORDER BY age')
results = cursor.fetchall()

for row in results:
  print(row)

('user3', 22)
('user1', 25)
('user2', 30)

In [ ]:
# Выбираем и сортируем пользователей по возрасту по убыванию
cursor.execute('SELECT username, age FROM Users ORDER BY username DESC')
results = cursor.fetchall()

for row in results:
  print(row)

('user3', 22)
('user2', 30)
('user1', 25)

### Продолжение лекции

In [ ]:
import sqlite3

In [ ]:
connection = sqlite3.connect('my_database.db')

In [ ]:
cursor = connection.cursor()

# Создаем таблицу Users
cursor.execute('''
CREATE TABLE IF NOT EXISTS Users (
    id INTEGER PRIMARY KEY,
    username TEXT NOT NULL,
    email TEXT NOT NULL,
    age INTEGER
)
''')

# Сохраняем изменения и закрываем соединение
connection.commit()

In [ ]:
# SQL-запрос для вставки строки в таблицу Users
sql_query = 'INSERT INTO Users (username, email, age) VALUES (?, ?, ?)'

# Список кортежей с данными для вставки
data_to_insert = [
    ('user1', 'user1@example.com', 25),
    ('user2', 'user2@example.com', 30),
    ('user3', 'user3@example.com', 22)
]

# Вставляем несколько строк сразу
cursor.executemany(sql_query, data_to_insert)

# Сохраняем изменения
connection.commit()

In [ ]:
# Выбираем всех пользователей
cursor.execute('SELECT * FROM Users')
users = cursor.fetchall()

users

[(2, 'user1', 'user1@example.com', 25),
 (3, 'user2', 'user2@example.com', 30),
 (4, 'user3', 'user3@example.com', 22),
 (5, 'user1', 'user1@example.com', 25),
 (6, 'user2', 'user2@example.com', 30),
 (7, 'user3', 'user3@example.com', 22),
 (8, 'user4', 'user4@example.com', 25),
 (9, 'user5', 'user5@example.com', 30),
 (10, 'user6', 'user6@example.com', 22),
 (11, 'user1', 'user1@example.com', 25),
 (12, 'user2', 'user2@example.com', 30),
 (13, 'user3', 'user3@example.com', 22)]

In [ ]:
# Выбираем одинь пользователь
cursor.execute('SELECT * FROM Users')
users = cursor.fetchone()

users

(2, 'user1', 'user1@example.com', 25)

In [ ]:
users = cursor.fetchone() # Продолжает вывести пользователей(столбцы), которые после пользователь результать прошлого запроса

users

(6, 'user2', 'user2@example.com', 30)

In [ ]:
# Выбираем 3 пользователей
cursor.execute('SELECT * FROM Users')
for i in range(3):
    print(cursor.fetchone())

# users

(2, 'user1', 'user1@example.com', 25)
(3, 'user2', 'user2@example.com', 30)
(4, 'user3', 'user3@example.com', 22)

In [ ]:
list(cursor.execute('SELECT * FROM Users'))

[(2, 'user1', 'user1@example.com', 25),
 (3, 'user2', 'user2@example.com', 30),
 (4, 'user3', 'user3@example.com', 22),
 (5, 'user1', 'user1@example.com', 25),
 (6, 'user2', 'user2@example.com', 30),
 (7, 'user3', 'user3@example.com', 22)]

In [ ]:
# SQL-запрос для вставки строки в таблицу Users
sql_query = 'INSERT INTO Users (username, email, age) VALUES (?, ?, ?)'

# Список кортежей с данными для вставки
data_to_insert = [
    ('user4', 'user4@example.com', 25),
    ('user5', 'user5@example.com', 30),
    ('user6', 'user6@example.com', 22)
]

# Вставляем несколько строк сразу
cursor.executemany(sql_query, data_to_insert)

# executemany is a method in the cursor object of the SQLite3 database module in Python,
# which is used to execute a database operation (such as INSERT, UPDATE, or DELETE) on multiple rows of data.

# The syntax for executemany is:
# cursor.executemany(operation, params)

# Where:
# operation is a string containing the SQL operation to be executed (e.g., "INSERT INTO table_name VALUES (:a, :b)", where :a and :b are placeholders for the values to be inserted).
# params is a sequence of tuples, where each tuple contains the values to be inserted into the placeholders in the operation string.

# Сохраняем изменения
connection.commit()

In [ ]:
# Выбираем всех пользователей
cursor.execute('SELECT * FROM Users')
users = cursor.fetchall()

users

[(2, 'user1', 'user1@example.com', 25),
 (3, 'user2', 'user2@example.com', 30),
 (4, 'user3', 'user3@example.com', 22),
 (5, 'user1', 'user1@example.com', 25),
 (6, 'user2', 'user2@example.com', 30),
 (7, 'user3', 'user3@example.com', 22),
 (8, 'user4', 'user4@example.com', 25),
 (9, 'user5', 'user5@example.com', 30),
 (10, 'user6', 'user6@example.com', 22)]

In [ ]:
# Выбираем 2 пользователя
cursor.execute('SELECT * FROM Users')
users = cursor.fetchmany(2)

users

[(2, 'user1', 'user1@example.com', 25), (3, 'user2', 'user2@example.com', 30)]

In [ ]:
users = cursor.fetchmany(3)  # результаты здесь будет продолжение после результатов прошлого запроса

users

[(4, 'user3', 'user3@example.com', 22),
 (5, 'user1', 'user1@example.com', 25),
 (6, 'user2', 'user2@example.com', 30)]

In [ ]:
users = cursor.fetchmany(2)

users

[(7, 'user3', 'user3@example.com', 22), (8, 'user4', 'user4@example.com', 25)]

In [ ]:
# Выбираем первый пользователь
cursor.execute('SELECT * FROM Users')
users = cursor.fetchmany()

users

[(2, 'user1', 'user1@example.com', 25)]

# ТАБЛИЧНЫЕ ВЫРАЖЕНИЯ CTE

In [ ]:
# ПИШЕМ В SQL ONLINE USING POSTGRES (click to connect)


# -- ТАБЛИЧНЫЕ ВЫРАЖЕНИЯ CTE

# -- Для чего нужно CTE в sqlite и Python, Обобщённое табличное выражение,
# -- CTE (Common Table Expressions) в SQLite и Python используются для:

# -- 1. Разбиения сложных запросов на более простые и читаемые части.
# -- 2. Выполнения рекурсивных запросов для работы с иерархическими данными.
# -- 3. Повторного использования подзапросов в основном запросе.
# -- 4. Улучшения читаемости и поддержки кода.

# Несколько CTE можно делать, одну в другой нельзя.


-- Создаем таблицу users:
CREATE TABLE users (
username VARCHAR(50),
password VARCHAR(50),
status VARCHAR(10));

-- Создаем таблицу users_profile:
CREATE TABLE users_profile (
username VARCHAR(50),
name VARCHAR(50),
address VARCHAR(50),
email VARCHAR(50));


INSERT INTO users values
('admin' , '7856', 'Active'),
('staff' , '90802', 'Active'),
('manager' , '35462', 'Inactive');

INSERT INTO users_profile values
('admin', 'Administrator' , 'Dhanmondi', 'admin@test.com' ) ,
('staff', 'Jakir Nayek' , 'Mirpur', 'zakir@test.com' ),
('manager', 'Mehr Afroz' , 'Eskaton', 'mehr@test.com' );





SELECT * FROM users;

SELECT * FROM users_profile;


WITH cte_users_profile AS
(
	SELECT *
  	FROM users_profile
  	WHERE username = 'staff'
)
SELECT * FROM cte_users_profile;


# SELECT * FROM cte_users_profile;


-- в cte считаем активных и неактивных
WITH count_user_status AS
(
	SELECT
  		status,
  		COUNT(*) AS cnt
  	FROM users
  	GROUP BY status
)
SELECT *
# SELECT cnt   #запускай и смотри результат
FROM count_user_status
WHERE LOWER(status) = 'active';
# WHERE LOWER(status) = 'active';


-- выбрать всю информацию о пользователях у которых пароль из 5 цифр
WITH username_pass_5 AS
(
 	SELECT
  		username
  	FROM users
  	WHERE LENGTH(password) = 5
)
SELECT up.*
FROM users_profile AS up
--
JOIN username_pass_5 AS u
	ON up.username = u.username



SELECT *
FROM users_profile AS up
--
JOIN users AS u
	ON up.username = u.username


#  --   WITH RECURSIVE

# -- Создаем таблицу employees:
# CREATE TABLE employees (
#     employee_id INT,
#     first_name VARCHAR(50),
#     last_name VARCHAR(50),
#     department_id INT,
#     birthdate DATE
# );
# -- Создаем таблицу departments:
# CREATE TABLE departments (
#     department_id INT,
#     department_name VARCHAR(50)
# );



# INSERT INTO departments (department_id, department_name)
# VALUES
#     (1, 'IT'),
#     (2, 'HR'),
#     (3, 'Sales');

# INSERT INTO employees (employee_id, first_name, last_name, department_id, birthdate)
# VALUES
#     (1, 'John', 'Doe', 1, '1990-05-15'),
#     (2, 'Jane', 'Smith', 1, '1985-03-22'),
#     (3, 'Michael', 'Johnson', 2, '1992-08-10'),
#     (4, 'Emily', 'Brown', 2, '1988-11-30'),
#     (5, 'David', 'Lee', 3, '1995-07-05');



# -- вывести информацию о сотрудниках из HR
# SELECT
# 	e.*
# FROM employees AS e
# JOIN departments AS d
# 	ON e.department_id = d.department_id
# WHERE d.department_name = 'HR'


# SELECT
# 	e.*
# FROM employees AS e
# WHERE department_id IN (SELECT department_id
#                         FROM departments
#                         WHERE department_name IN ('HR', 'IT'))


# SELECT
# 	*
# FROM employees AS e
# JOIN departments AS d
# 	ON e.department_id = d.department_id
# -- JOIN departments AS d2
# --	ON e.department_id = d2.department_id


# -- EXISTS
# SELECT * FROM employees WHERE first_name = 'John'
# SELECT * FROM employees WHERE first_name = 'Jofghjkhn'

# SELECt EXISTS (SELECT * FROM employees WHERE first_name = 'John');
# SELECt EXISTS (SELECT * FROM employees WHERE first_name = 'Jofghjkhn');


# INSERT INTO employees (employee_id, first_name, last_name, department_id, birthdate)
# VALUES
#     (6, 'Helen', 'Doe', 8, '1990-05-15'),
#     (7, 'Tom', 'Smith', 9, '1985-03-22');

# -- вывести сотрудников, у которых есть департамент
# SELECT *
# FROM employees
# WHERE department_id IN (select department_id FROM departments)

# SELECT *
# FROM employees AS e
# WHERE EXISTS (select *
#               FROM departments AS d
#               WHERE d.department_id = e.department_id)


# SELECT
# 	*
# FROM employees AS e
# JOIN departments AS d
# 	ON e.department_id = d.department_id

SyntaxError: invalid syntax (<ipython-input-104-91ad87d2ca71>, line 1)